[
    {
        "type": "message",
        "user": "U0CNE6C00",
        "text": "hallo all! for those that weren't in the meetup the other day (or the ones I haven't pinged privately yet) we have this job opening that we thought may be interesting - I think its a cool project, with a cool team and can be remote (although we have offices in London and Madrid) so... Would appreciate if you check it out and ping me if you have questions or interest :simple_smile:",
        "ts": "1445598689.000007"
    },
    {
        "type": "message",
        "user": "U0CNE6C00",
        "text": "<http:\/\/localistico.com\/team\/openings\/frontend-fullstack-engineer.html>",
        "attachments": [
            {
                "service_name": "Localistico",
                "title": "Want to join us?",
                "title_link": "http:\/\/localistico.com\/team\/openings\/frontend-fullstack-engineer.html",
                "text": "Localistico - We make your business easier to find online.",
                "fallback": "Localistico: Want to join us?",
                "from_url": "http:\/\/localistico.com\/team\/openings\/frontend-fullstack-engineer.html",
                "id": 1
            }
        ],
        "ts": "1445598694.000008"
    },
    {
        "type": "message",
        "user": "U0CNE6C00",
        "text": "Also, as I mentioned too: it is the first time we write a job offer so any feedback about how to improve it or details you think are missing, please send me private message! always keen to learn how to do it better (haven't read that many offers myself, I'm afraid)",
        "ts": "1445598784.000010"
    },
    {
        "type": "message",
        "user": "U06BGNMBL",
        "text": "Very good to see a salary range in there - something missing from about 99% of tech job ads IME, and very necessary IMHO",
        "ts": "1445606957.000011"
    },
    {
        "type": "message",
        "user": "U047GTU64",
        "text": "^^^^ 100% agree",
        "ts": "1445607276.000012"
    },
    {
        "type": "message",
        "user": "U0CNE6C00",
        "text": "yes, we included it because several people mentioned they usually prefer when they can see a salary range",
        "ts": "1445611615.000013"
    },
    {
        "type": "message",
        "user": "U0CNE6C00",
        "text": "its a tricky one, because i can also see how some people prefer to leave it aside if they want to discuss it with the candidate but... on the other hand when somebody is a poor startup like us I think its better to get out of the way the fact that we can't really afford 90K salaries (yet)",
        "ts": "1445611728.000014"
    },
    {
        "type": "message",
        "user": "U0CNE6C00",
        "text": "(people do this more for the projects, teams and the occasional-but-possible variable gain)",
        "ts": "1445611747.000015"
    },
    {
        "type": "message",
        "user": "U04BE0ELZ",
        "text": "90k now that's nice :)",
        "ts": "1445625090.000016"
    }
]