[
    {
        "type": "message",
        "user": "U03SSL0FM",
        "text": "<http:\/\/blog.circleci.com\/its-the-future\/>",
        "ts": "1433892873.000038"
    },
    {
        "type": "message",
        "user": "U03SSL0FM",
        "text": "<http:\/\/fourhourworkweek.com\/2007\/09\/14\/the-top-5-reasons-to-be-a-jack-of-all-trades\/>",
        "attachments": [
            {
                "service_name": "The Blog of Author Tim Ferriss",
                "service_url": "http:\/\/fourhourworkweek.com",
                "title": "The Top 5 Reasons to Be a Jack of All Trades",
                "title_link": "http:\/\/fourhourworkweek.com\/2007\/09\/14\/the-top-5-reasons-to-be-a-jack-of-all-trades\/",
                "author_name": "Tim Ferriss",
                "author_link": "https:\/\/fourhourworkweek.com\/author\/tferriss\/",
                "thumb_url": "https:\/\/i2.wp.com\/fhww.files.wordpress.com\/2007\/09\/1951_plymouth_assembly_line___little_did_we_realize_in_1951_e280a6___flickr_-_photo_sharing_.png?fit=200%2C150&quality=80&strip=all",
                "thumb_width": 200,
                "thumb_height": 145,
                "text": "Specialization isn’t always a good thing. Photo from 1951 assembly line.\nAre the days of Da Vinci dead? Is it possible to, at once, be a world-class painter, engineer, scientist, and more?\n\n“No way. Those times are long gone. Nothing was discovered then. Now the best you can do is pick your field and master it.”\n\nThe devout specialist is fond of labeling the impetuous learner–Da Vinci and Ben Franklin being just two forgotten examples–“jack of all trades, master of none.” The chorus unites: In the modern world, it is he who specializes who survives and thrives. There is no place for Renaissance men or women. Starry-eyed amateurs.\nIs it true?  I don’t think so. Here are the top five reasons why being a “jack of all trades,” what I prefer to call a “generalist,” is making a comeback:\n5) “Jack of all trades, master of none” is an artificial pairing. \nIt is entirely possible to be a jack of all trades, master of many. How? Specialists overestimate the time needed to “master” a skill and confuse “master” with “perfect”…\nGeneralists recognize that the 80\/20 principle applies to skills: 20% of a language’s vocabulary will enable you to communicate and understand at least 80%, 20% of a dance like tango (lead and footwork) separates the novice from the pro, 20% of the moves in a sport account for 80% of the scoring, etc. Is this settling for mediocre?\nNot at all. Generalists take the condensed study up to, but not beyond, the point of rapidly diminishing returns. There is perhaps a 5% comprehension difference between the focused generalist who studies Japanese systematically for 2 years vs. the specialist who studies Japanese for 10 with the lack of urgency typical of those who claim that something “takes a lifetime to learn.” Hogwash. Based on my experience and research, it is possible to become world-class in almost any skill within one year.\n4) In a world of dogmatic specialists, it’s the generalist who ends up running the show.\n\nIs the CEO a better accountant than the CFO or CPA? Was Steve Jobs a better programmer than top coders at Apple? No, but he had a broad range of skills and saw the unseen interconnectedness. As technology becomes a commodity with the democratization of information, it’s the big-picture generalists who will predict, innovate, and rise to power fastest. There is a reason military “generals” are called such.\n3) Boredom is failure. \nIn a first-world economy where we have the physical necessities covered with even low-class income, Mazlow’s hierarchy of needs drives us to need more for any measure of comparative “success.” Lack of intellectual stimulation, not superlative material wealth, is what drives us to depression and emotional bankruptcy. Generalizing and experimenting prevents this, while over-specialization guarantees it.\n2) Diversity of intellectual playgrounds breeds confidence instead of fear of the unknown. \nIt also breeds empathy with the broadest range of human conditions and appreciation of the broadest range of human accomplishments. The alternative is the defensive xenophobia and smugness uniquely common to those whose identities are defined by their job title or single skill, which they pursue out of obligation and not enjoyment.\n1) It’s more fun, in the most serious existential sense. \nThe jack of all trades maximizes his number of peak experiences in life and learns to enjoy the pursuit of excellence unrelated to material gain, all while finding the few things he is truly uniquely suited to dominate.\nThe specialist who imprisons himself in self-inflicted one-dimensionality — pursuing and impossible perfection — spends decades stagnant or making imperceptible incremental improvements while the curious generalist consistently measures improvement in quantum leaps. It is only the latter who enjoys the process of pursuing excellence.\n\nDon’t put on experiential blinders in the name of specializing. It’s both unnecessary and crippling. Those who label you a “jack of all trades, master of none” are seldom satisfied with themselves.\nWhy take their advice?\nHere is a description of the incredible Alfred Lee Loomis, a generalist of the highest order who changed the course of World War II with his private science experiments, here taken from the incredible portrait of his life, Tuxedo Park:\nLoomis did not conform to the conventional measure of a great scientist. He was too complex to categorize — financier, philanthropist, society figure, physicist, inventor, amateur, dilettante — a contradiction in terms.\nBe too complex to categorize.\nLook far and wide.  There are worlds to conquer. \n###",
                "fallback": "The Blog of Author Tim Ferriss Link: The Top 5 Reasons to Be a Jack of All&nbsp;Trades",
                "from_url": "http:\/\/fourhourworkweek.com\/2007\/09\/14\/the-top-5-reasons-to-be-a-jack-of-all-trades\/",
                "id": 1
            }
        ],
        "ts": "1433895471.000039"
    },
    {
        "type": "message",
        "user": "U03SSL0FM",
        "text": "that is why I am who I am",
        "ts": "1433895478.000041"
    },
    {
        "type": "message",
        "user": "U04BE0ELZ",
        "text": "nice read!",
        "ts": "1433915005.000042"
    }
]