[
    {
        "type": "message",
        "user": "U0A9ALENN",
        "text": "Hey guys, just a quick introduction: I’m Alexander Jeurissen a frontend developer \/ computer science student from Holland.\nI work at DefactoSoftware in Groningen and the product I’m working on (<http:\/\/LearningSpaces.io|LearningSpaces.io>) is a ember + rails app.\nI came across this community through a blogpost of a member about initializers in ember-cli, in this post he linked back to your slack community :wink:\n\nI hope to find interesting articles here and to have found a nice active community where we can exchange ember knowledge.",
        "ts": "1441804860.000006"
    },
    {
        "type": "message",
        "user": "U05485UQL",
        "text": "hello there!",
        "ts": "1441805208.000007"
    },
    {
        "type": "message",
        "user": "U05485UQL",
        "text": "<@U0A9ALENN>: how do you put together Ember and Rails? All in a single app with something like ember-rails? Separate apps using ember-cli? Something else?",
        "ts": "1441805249.000008"
    },
    {
        "type": "message",
        "user": "U0A9ALENN",
        "text": "we are using ember-rails, But I’m currently working on migrating to ember-cli rails as a temporary solution. Eventually we’d like to have both apps separate.",
        "ts": "1441805890.000009"
    },
    {
        "type": "message",
        "user": "U0A9ALENN",
        "text": "point is that we want to run ember-cli asap, we’ll keep the Devise views etc. for now but eventually will  use something like ember-cli-simple auth etc.",
        "ts": "1441805956.000010"
    },
    {
        "type": "message",
        "user": "U05485UQL",
        "text": "cool. I’m a Rails dev myself, and I’d like to hear more stories about this. It’s a topic I’m not terribly comfortable with",
        "ts": "1441806136.000011"
    },
    {
        "type": "message",
        "user": "U0A9ALENN",
        "text": "it’s quite a hassle indeed, especially because my ember-cli migration branch is currently around 60 commits behind our main develop branch xD",
        "ts": "1441806285.000012"
    },
    {
        "type": "message",
        "user": "U0A9ALENN",
        "text": "gonna be fun to rebase all that",
        "ts": "1441806302.000013"
    },
    {
        "type": "message",
        "user": "U05485UQL",
        "text": "ooops!",
        "ts": "1441806363.000014"
    },
    {
        "type": "message",
        "user": "U03V8V08M",
        "text": "hi <@U0A9ALENN> great to meet you",
        "ts": "1441808672.000015"
    },
    {
        "type": "message",
        "user": "U047GTU64",
        "text": "hello <@U0A9ALENN> nice to meet you",
        "ts": "1441808904.000016"
    },
    {
        "type": "message",
        "user": "U0A9ALENN",
        "text": "thank you all for the warm welcome :wink:",
        "ts": "1441809260.000017"
    },
    {
        "type": "message",
        "user": "U043AB2QT",
        "text": "Welcome <@U0A9ALENN>",
        "ts": "1441809709.000018"
    },
    {
        "type": "message",
        "user": "U043AB2QT",
        "text": "<@U0A9ALENN> \/ <@U05485UQL> We are incrementally migrating a rails app across to ember-cli so the users can see no difference and wouldn't have a clue if they are on a rails page or an ember page.....Happy to chat through my experiences on this subject if you like.",
        "ts": "1441809806.000019"
    },
    {
        "type": "message",
        "user": "U05485UQL",
        "text": "I may grab you tomorrow :simple_smile:",
        "ts": "1441810927.000020"
    },
    {
        "type": "message",
        "user": "U043AB2QT",
        "text": "Sure thing <@U05485UQL>  :thumbsup:",
        "ts": "1441814327.000021"
    },
    {
        "type": "message",
        "user": "U0A9ALENN",
        "text": "<@U043AB2QT>: that’s interesting, I have read several blogs about people that did a similar migration. What your describing is also our goal with migrating to ember-cli.",
        "ts": "1441817949.000022"
    },
    {
        "type": "message",
        "user": "U0A9ALENN",
        "text": "we still have too many rails views \/ tight coupling between rails and ember and therefore it’s not doable to migrate all at once. The code base is just too large for that.",
        "ts": "1441817993.000023"
    },
    {
        "type": "message",
        "user": "U0A9ALENN",
        "text": "it’s the result of a rapid prototype written in rails, with some ember on top. so it’s gonna take a while to remove the coupling and the logic duplication that will eventually happen is worth the separation of concerns in the long term.",
        "ts": "1441818089.000024"
    },
    {
        "type": "message",
        "user": "U043AB2QT",
        "text": "Yup. A Big Bang generally isn't the best approach. If you can take an incremental approach then you should in my opinion. I'll dig up the blog post I wrote on our setup if you're interested. It might be of use. ",
        "ts": "1441818108.000025"
    },
    {
        "type": "message",
        "user": "U043AB2QT",
        "text": "Sounds very much like our setup mate. ",
        "ts": "1441818128.000026"
    },
    {
        "type": "message",
        "user": "U0A9ALENN",
        "text": "I’m definitely interested in that blog post",
        "ts": "1441818136.000027"
    }
]